config.org
#+title: MacPapo's Config
#+author: Jacopo Costantini


* General Settings

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;; init.el --- Load the full configuration -*- lexical-binding: t -*-

  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
  (defconst *is-a-mac* (eq system-type 'darwin))

  (setq custom-file (locate-user-emacs-file "custom.el"))
  (when (file-exists-p custom-file)
    (load custom-file))

  (setq use-file-dialog nil)
  (setq use-dialog-box nil)
  (setq inhibit-startup-screen t)

  (setq-default
   window-resize-pixelwise t
   frame-resize-pixelwise t)

  (when (fboundp 'tool-bar-mode)
    (tool-bar-mode -1))
  (when (fboundp 'set-scroll-bar-mode)
    (set-scroll-bar-mode nil))

  (menu-bar-mode 1)

  ;; TODO: sposta da qui
  (setq-default history-length 1000)
  (add-hook 'after-init-hook 'savehist-mode)

#+end_src

** GC Optimizations

#+begin_src elisp :tangle ~/.emacs.d/early-init.el
  ;; -*- lexical-binding: t; -*
  (setq package-enable-at-startup nil)

  (let ((normal-gc-cons-threshold (* 20 1024 1024))
        (init-gc-cons-threshold (* 128 1024 1024)))
    (setq gc-cons-threshold init-gc-cons-threshold)
    (add-hook 'emacs-startup-hook
              (lambda () (setq gc-cons-threshold normal-gc-cons-threshold))))
#+end_src

** Package manager configuration

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-pkgmanager.el
  ;; -*- lexical-binding: t; -*-
  
  (require 'package)
  (add-to-list 'package-archives '("gnu"   . "https://elpa.gnu.org/packages/"))
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (package-initialize)

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (provide 'init-pkgmanager)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-pkgmanager)
#+end_src

** User local preferences

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-local nil t) 
#+end_src

** Appearance

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-theme.el
  ;; -*- lexical-binding: t; -*-
  
  (setq custom-safe-themes t)

  (use-package diminish
    :ensure t)

  (use-package zenburn-theme
    :ensure t
    :init
    (load-theme 'zenburn t))

  (use-package pulsar
    :ensure t
    :config
    (setq pulsar-pulse t
          pulsar-face 'pulsar-blue
          pulsar-highlight-face 'pulsar-yellow
          pulsar-delay 0.055)
    (add-to-list 'pulsar-pulse-functions 'ace-window)
    :init
    (pulsar-global-mode 1))

  (let ((no-border '(internal-border-width . 0)))
    (add-to-list 'default-frame-alist no-border)
    (add-to-list 'initial-frame-alist no-border))

  (setq frame-title-format
        '((:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name))
                   "%b"))))

  (provide 'init-theme)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-theme)
#+end_src


** Keybindings

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-macos.el
  ;; -*- lexical-binding: t; -*-

  (when *is-a-mac*
    (setq mac-command-modifier 'meta)
    (setq mac-option-modifier 'none)


    (use-package helm-osx-app
      :bind (("C-c SPC" . helm-osx-app))
      :ensure t)

    (use-package osx-trash
      :ensure t
      :init
      (osx-trash-setup)
      (setq delete-by-moving-to-trash t))

    (use-package reveal-in-osx-finder
      :ensure t
      :bind ("C-c z" . reveal-in-osx-finder))

    ;; (global-set-key (kbd "M-`") 'ns-next-frame)
    ;; (global-set-key (kbd "M-h") 'ns-do-hide-emacs)
    ;; (global-set-key (kbd "M-˙") 'ns-do-hide-others)
    ;; (global-set-key (kbd "M-ˍ") 'ns-do-hide-others) ;; what describe-key reports for cmd-option-h
    )

  (provide 'init-macos)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-macos)
#+end_src

** Uniquify Names

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-uniquify.el
  ;; -*- lexical-binding: t; -*-

  ;; Nicer naming of buffers for files with identical names
  (require 'uniquify)

  (setq uniquify-buffer-name-style 'reverse)
  (setq uniquify-separator " • ")
  (setq uniquify-after-kill-buffer-p t)
  (setq uniquify-ignore-buffers-re "^\\*")

  (provide 'init-uniquify)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-uniquify)
#+end_src

** Recentf

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-recentf.el
  ;; -*- lexical-binding: t; -*-

  (add-hook 'after-init-hook 'recentf-mode)
  (setq-default
   recentf-max-saved-items 1000
   recentf-exclude `("/tmp/" "/ssh:" ,(concat package-user-dir "/.*-autoloads\\.el\\'")))

  (provide 'init-recentf)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-recentf)
#+end_src

** Hippie Expand

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-hippie-expand.el
  ;; -*- lexical-binding: t; -*-

  (global-set-key (kbd "M-/") 'hippie-expand)

  (setq hippie-expand-try-functions-list
        '(try-complete-file-name-partially
          try-complete-file-name
          try-expand-dabbrev
          try-expand-dabbrev-all-buffers
          try-expand-dabbrev-from-kill))

  (provide 'init-hippie-expand)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-hippie-expand)
#+end_src

** Editing Utils

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-editing-utils.el
  ;; -*- lexical-binding: t; -*-

  (when (fboundp 'electric-pair-mode)
    (add-hook 'after-init-hook 'electric-pair-mode))
  (add-hook 'after-init-hook 'electric-indent-mode)

  (setq-default
   blink-cursor-interval 0.4
   bookmark-default-file (locate-user-emacs-file ".bookmarks.el")
   buffers-menu-max-size 30
   case-fold-search t
   column-number-mode t
   ediff-split-window-function 'split-window-horizontally
   ediff-window-setup-function 'ediff-setup-windows-plain
   indent-tabs-mode nil
   create-lockfiles nil
   auto-save-default nil
   make-backup-files nil
   mouse-yank-at-point t
   save-interprogram-paste-before-kill t
   scroll-preserve-screen-position 'always
   set-mark-command-repeat-pop t
   tooltip-delay 1.5
   truncate-lines nil
   visible-bell t
   use-short-answers t
   kill-do-not-save-duplicates t
   echo-keystrokes 0.02
   truncate-partial-width-windows nil)

  (add-hook 'after-init-hook 'delete-selection-mode)

  (add-hook 'after-init-hook 'global-auto-revert-mode)
  (setq global-auto-revert-non-file-buffers t
        auto-revert-verbose nil)
  (with-eval-after-load 'autorevert
    (diminish 'auto-revert-mode))

  (add-hook 'after-init-hook 'transient-mark-mode)

  (with-eval-after-load 'subword
    (diminish 'subword-mode))

  (when (fboundp 'display-line-numbers-mode)
    (setq-default display-line-numbers-width 3)
    (add-hook 'prog-mode-hook 'display-line-numbers-mode))

  (when (boundp 'display-fill-column-indicator)
    (setq-default indicate-buffer-boundaries 'left)
    (setq-default display-fill-column-indicator-character ?\u254e)
    (add-hook 'prog-mode-hook 'display-fill-column-indicator-mode))

  (put 'narrow-to-region 'disabled nil)
  (put 'narrow-to-page 'disabled nil)
  (put 'narrow-to-defun 'disabled nil)

  (put 'upcase-region 'disabled nil)
  (put 'downcase-region 'disabled nil)

  (add-hook 'after-init-hook 'show-paren-mode)

  (use-package avy
    :ensure t
    :bind (("C-:" . avy-goto-char)
           ("C-'" . avy-goto-char-2)
           ("M-g f" . avy-goto-line)
           ("M-g w" . avy-goto-word-1)
           ("M-g e" . avy-goto-word-0))
    :config
    (setq avy-background t)
    (setq avy-style 'at-full))

  (use-package multiple-cursors
    :ensure t
    :bind (("C-S-c C-S-c" . mc/edit-lines)
           ("C->" . mc/mark-next-like-this)
           ("C-<" . mc/mark-previous-like-this)
           ("C-c C-<" . mc/mark-all-like-this)))

  (use-package ace-mc
    :ensure t
    :bind (("C-c M-j" . ace-mc-add-multiple-cursors)
           ("C-c M-k" . ace-mc-add-single-cursor)))

  (global-unset-key [M-left])
  (global-unset-key [M-right])

  (use-package whole-line-or-region
    :ensure t
    :diminish whole-line-or-region-local-mode
    :init
    (add-hook 'after-init-hook 'whole-line-or-region-global-mode))

  (global-set-key (kbd "M-j") 'join-line)

  (use-package highlight-escape-sequences
    :ensure t
    :init
    (add-hook 'after-init-hook 'hes-mode))

  (provide 'init-editing-utils)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-editing-utils)
#+end_src

** Treesitter

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-treesitter.el
  ;; -*- lexical-binding: t; -*-

  (setq treesit-load-name-override-list nil
        major-mode-remap-alist nil
        treesit-font-lock-level 4)

  (use-package treesit-auto
    :ensure t
    :config
    (global-treesit-auto-mode))

  (provide 'init-treesitter)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-treesitter)
#+end_src

** Flymake Flycheck

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-flymake.el
  ;; -*- lexical-binding: t; -*-

  (use-package flymake-flycheck
    :ensure t
    :init
    (with-eval-after-load 'flycheck
      (setq-default flycheck-disabled-checkers
                    (append (default-value 'flycheck-disabled-checkers)
                            '(emacs-lisp emacs-lisp-checkdoc emacs-lisp-package))))
    (defun my/enable-flymake-flycheck ()
      (setq-local flymake-diagnostic-functions
                  (append flymake-diagnostic-functions
                          (flymake-flycheck-all-chained-diagnostic-functions))))

    (add-hook 'flymake-mode-hook 'my/enable-flymake-flycheck)
    (add-hook 'prog-mode-hook    'flymake-mode)
    (add-hook 'text-mode-hook    'flymake-mode))

  (with-eval-after-load 'flymake
    ;; Provide some flycheck-like bindings in flymake mode to ease transition
    (define-key flymake-mode-map (kbd "C-c ! l") 'flymake-show-buffer-diagnostics)
    (define-key flymake-mode-map (kbd "C-c ! n") 'flymake-goto-next-error)
    (define-key flymake-mode-map (kbd "C-c ! p") 'flymake-goto-prev-error)
    (define-key flymake-mode-map (kbd "C-c ! c") 'flymake-start))

  (setq eldoc-documentation-function 'eldoc-documentation-compose)

  (add-hook 'flymake-mode-hook
            (lambda ()
              (setq eldoc-documentation-functions
                    (cons 'flymake-eldoc-function
                          (delq 'flymake-eldoc-function eldoc-documentation-functions)))))

  (when (fboundp 'global-eldoc-mode)
    (add-hook 'after-init-hook 'global-eldoc-mode))

  (provide 'init-flymake)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-flymake)
#+end_src

** Miscelaneous

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-misc.el
  ;; -*- lexical-binding: t; -*-

  (use-package info-colors
    :ensure t
    :init
    (with-eval-after-load 'info
      (add-hook 'Info-selection-hook 'info-colors-fontify-node)))

  (use-package shfmt
    :ensure t)

  (use-package dotenv-mode
    :ensure t)

  (use-package crux
    :ensure t
    :bind
    ([remap move-beginning-of-line] . crux-move-beginning-of-line)
    ([remap kill-whole-line]        . crux-kill-whole-line)
    ("C-<backspace>"                . crux-kill-line-backwards)
    ("C-S-o"                        . crux-smart-open-line-above)
    ("C-o"                          . crux-smart-open-line)
    ("C-c n"                        . crux-cleanup-buffer-or-region)
    ("C-c d"                        . crux-duplicate-current-line-or-region)
    ("C-c M-d"                      . crux-duplicate-and-comment-current-line-or-region)
    ("C-c r"                        . crux-rename-file-and-buffer)
    ("C-^"                          . crux-top-join-line)
    ("C-x C-u"                      . crux-upcase-region)
    ("C-x C-l"                      . crux-downcase-region)
    ("C-x M-c"                      . crux-capitalize-region))

  (use-package rainbow-delimiters
    :ensure t
    :hook (prog-mode . rainbow-delimiters-mode))

  (provide 'init-misc)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-misc)
#+end_src

** Shell

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-shell.el
  ;; -*- lexical-binding: t; -*-

  ;;(global-set-key (kbd "C-c e") 'eshell)

  (use-package eshell-prompt-extras
    :ensure t
    :init
    (with-eval-after-load "esh-opt"
      (autoload 'epe-theme-lambda "eshell-prompt-extras")
      (setq eshell-highlight-prompt nil
            eshell-prompt-function 'epe-theme-lambda)))

  (use-package eshell-syntax-highlighting
    :ensure t
    :config
    (eshell-syntax-highlighting-global-mode +1))

  (provide 'init-shell)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-shell)
#+end_src

** Folding

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-folding.el
  ;; -*- lexical-binding: t; -*-

  (use-package origami
    :ensure t
    :bind (("C-c f" . origami-recursively-toggle-node)
           ("C-c F" . origami-toggle-all-nodes))
    :hook (prog-mode . origami-mode))

  (provide 'init-folding)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-folding)
#+end_src

* Packages

** Dired

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-dired.el
  ;; -*- lexical-binding: t; -*-

  (require 'dired)
  (setq-default dired-dwim-target t)

  ;; Prefer g-prefixed coreutils version of standard utilities when available
  (let ((gls (executable-find "gls")))
    (when gls (setq insert-directory-program gls)))

  (use-package diredfl
    :ensure t
    :config
    (diredfl-global-mode 1))

  (use-package dired-recent
    :ensure t
    :init
    (dired-recent-mode 1))

  (use-package dired-hacks-utils
    :ensure t
    :bind (:map dired-mode-map
                ("M-n" . dired-hacks-next-file)
                ("M-p" . dired-hacks-previous-file)))

  (use-package dired-filter
    :ensure t
    :config
    :bind (:map dired-mode-map
                ("/" . dired-filter-mode)))

  (use-package dired-subtree
    :ensure t
    :bind (:map dired-mode-map
                ("i" . dired-subtree-insert)
                (";" . dired-subtree-remove)))

  (use-package dired-narrow
    :ensure t
    :bind (:map dired-mode-map
                ("s" . dired-narrow))
    :config
    (setq dired-narrow-exit-when-1-left nil))

  (provide 'init-dired)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-dired)
#+end_src

