config.org
** Git

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-git.el
  ;; -*- lexical-binding: t; -*-

  (use-package git-blamed
    :ensure t)

  (use-package git-modes
    :ensure t)

  (use-package git-timemachine
    :ensure t
    :bind ("C-x v t" . git-timemachine-toggle))

  (use-package magit
    :ensure t
    :bind
    (([(meta f12)] . magit-status)
     ("C-x g"      . magit-status)
     ("C-x M-g"    . magit-dispatch))
    :config
    (setq-default magit-diff-refine-hunk 'all)
    :init
    (when *is-a-mac*
      (with-eval-after-load 'magit
        (add-hook 'magit-mode-hook
                  (lambda () (local-unset-key [(meta h)]))))))

  (use-package forge
    :after magit
    :ensure t)

  (use-package diff-hl
    :ensure t
    :init
    (with-eval-after-load 'dired
      (add-hook 'dired-mode-hook 'diff-hl-dired-mode))
    (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
    (add-hook 'after-init-hook 'global-diff-hl-mode)
    (with-eval-after-load 'diff-hl
      (define-key diff-hl-mode-map
                  (kbd "<left-fringe> <mouse-1>")
                  'diff-hl-diff-goto-hunk)))

  (provide 'init-git)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-git)
#+end_src

** ORG MODE

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-org.el
  ;; -*- lexical-binding: t; -*-

  (use-package org-modern
    :ensure t
    :config
    (setq
     ;; Edit settings
     org-auto-align-tags nil
     org-tags-column 0
     org-catch-invisible-edits 'show-and-error
     org-special-ctrl-a/e t
     org-insert-heading-respect-content t

     ;; Org styling, hide markup etc.
     org-hide-emphasis-markers t
     org-pretty-entities t
     org-ellipsis "…"

     ;; Agenda styling
     org-agenda-tags-column 0
     org-agenda-block-separator ?─
     org-agenda-time-grid
     '((daily today require-timed)
       (800 1000 1200 1400 1600 1800 2000)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
     org-agenda-current-time-string
     "⭠ now ─────────────────────────────────────────────────")

    (global-org-modern-mode))

  (use-package org-wc
    :ensure t
    :after org)

  (use-package org-pomodoro
    :ensure t
    :after org)

  (use-package org-zettelkasten
    :ensure t
    :config
    (add-hook 'org-mode-hook #'org-zettelkasten-mode))

  (provide 'init-org)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-org)
#+end_src

** Yasnippet

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-yasnippet.el
  (use-package yasnippet
    :ensure t
    :defer 5
    :diminish yasnippet
    :init
    (yas-global-mode 1)
    :config
    ;; Directory per i tuoi snippet personali, se desideri
    ;; (setq yas-snippet-dirs '("~/.emacs.d/mysnippets"))
    (define-key yas-minor-mode-map (kbd "<backtab>") #'yas-expand))

  (use-package yasnippet-snippets
    :ensure t
    :defer 5)

  (use-package helm-c-yasnippet
    :ensure t
    :defer 5
    :bind (("C-c Y" . helm-yas-complete)
           ("<f6>" . helm-yas-visit-snippet-file))
    :config
    (setq helm-yas-space-match-any-greedy t))


  (provide 'init-yasnippet)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-yasnippet)
#+end_src

** Copilot

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-copilot.el
  (provide 'init-copilot)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-copilot)
#+end_src

* Languages

** Dart

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-dart.el
  ;; -*- lexical-binding: t; -*-

  (use-package dart-mode
    :ensure t
    :bind (:map dart-mode-map
                ("C-M-x" . flutter-run-or-hot-reload)))

  (use-package flutter
    :ensure t
    :config
    (setq dart-sdk-path (concat (getenv "HOME") "FlutterDev/flutter/bin/cache/dark-sdk/")
          dart-server-sdk-path (concat (getenv "HOME") "FlutterDev/flutter/bin/cache/dark-sdk/")
          dart-format-on-save t
          flutter-sdk-path "~/FlutterDev/flutter/"
          dart-server-enable-analysis-server t))

  (provide 'init-dart)
#+end_src

#+begin_src elisp :tangle ~/.emacs.d/init.el
  (require 'init-dart)
#+end_src
